apps/accounts/app/controllers/identity/sessions_controller.rb

    def set_session
      @session = System::Current.user.sessions.find(params[:id]) if params[:id].present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = 'f2872dab-3cb5-4046-ad93-810eed2cb72c' LIMIT 1